<template>
    <div class="container py-[70px] sm:py-6">
        <h1 class="text-center sm:text-h5 sm:!text-right">مقالات</h1>
        <BlogCategories />
        <div class="flex relative justify-between sm:flex-wrap">
            <div class="w-[30%] sticky top-2 h-fit sm:w-full sm:relative sm:mb-11">
                <BlogPopularArticles />
            </div>
            <div class="w-[67%] sm:w-full">
                <div class="card">
                    <base-img class="article-banner w-full mb-8" src="static/images/course.png" alt="article"
                        height="340px" />
                    <div class="writer flex items-center gap-[11px]">
                        <base-img src="static/images/users/avatar.png" class="rounded-full" alt="user" width="30"
                            height="30" />
                        <nuxt-link to="/" class="text-h8 font-bold text-black">محمد اشرافی</nuxt-link>
                    </div>
                    <p class="date">15 اردیبهشت 1402</p>
                    <h1 class="text-black text-h4">پروژه های توسعه چابک و قابلیت استفاده</h1>
                    <div class="content">
                        <p>
                            ساخت ربات تلگرام امروزه یکی از فعالیت‌های جذاب در دنیای برنامه‌نویسی به شمار می‌آید که دارای
                            کاربردهای زیادی نیز می‌باشد. شما می‌توانید پروژه‌های مختلف را تحت عنوان ربات تلگرام طراحی کرده و
                            پیاده‌سازی کنید. این پروژه علاوه بر این که می‌توانند مهارت برنامه‌نویسی شما را بهبود دهند بلکه
                            در
                            بسیاری از موارد می‌توانند درآمد بسیار خوبی را نیز برای شما داشته باشند.
                            در حال حاضر زبان‌های برنامه‌نویسی بسیار زیادی برای ساخت انواع ربات‌های تلگرامی مورداستفاده قرار
                            می‌گیرند که هریک از آنها دارای ویژگی‌ها و کاربردهای خاص خود هستند.
                            یکی از محبوب‌ترین زبان‌های برنامه‌نویسی که برای انجام این کار استفاده می‌شود زبان برنامه‌نویسی
                            پایتون است. ساخت ربات تلگرامی با پایتون کار چندان سختی نیست چراکه در این زبان کتابخانه‌ای جذاب
                            برای
                            انجام این کار طراحی شده است که به شما کمک می‌کند تا بتوانید بهترین ربات‌های تلگرامی را طراحی
                            کنید.
                            اگر شما هم جز آن دسته از افرادی هستید که علاقه‌مند به یادگیری نحوه طراحی و ساخت ربات‌های تلگرامی
                            با
                            استفاده از زبان برنامه‌نویسی پایتون هستید به شما پیشنهاد می‌کنیم ادامه این مطلب را بادقت مطالعه
                            کنید
                            تا اطلاعات و مهارت موردنیاز برای انجام این کار را به دست بیاورید.
                        </p>
                        <h2>سلام</h2>
                        <p>
                            ساخت ربات تلگرام امروزه یکی از فعالیت‌های جذاب در دنیای برنامه‌نویسی به شمار می‌آید که دارای
                            کاربردهای زیادی نیز می‌باشد. شما می‌توانید پروژه‌های مختلف را تحت عنوان ربات تلگرام طراحی کرده و
                            پیاده‌سازی کنید. این پروژه علاوه بر این که می‌توانند مهارت برنامه‌نویسی شما را بهبود دهند بلکه
                            در
                            بسیاری از موارد می‌توانند درآمد بسیار خوبی را نیز برای شما داشته باشند.
                            در حال حاضر زبان‌های برنامه‌نویسی بسیار زیادی برای ساخت انواع ربات‌های تلگرامی مورداستفاده قرار
                            می‌گیرند که هریک از آنها دارای ویژگی‌ها و کاربردهای خاص خود هستند.
                            یکی از محبوب‌ترین زبان‌های برنامه‌نویسی که برای انجام این کار استفاده می‌شود زبان برنامه‌نویسی
                            پایتون است. ساخت ربات تلگرامی با پایتون کار چندان سختی نیست چراکه در این زبان کتابخانه‌ای جذاب
                            برای
                            انجام این کار طراحی شده است که به شما کمک می‌کند تا بتوانید بهترین ربات‌های تلگرامی را طراحی
                            کنید.
                            اگر شما هم جز آن دسته از افرادی هستید که علاقه‌مند به یادگیری نحوه طراحی و ساخت ربات‌های تلگرامی
                            با
                            استفاده از زبان برنامه‌نویسی پایتون هستید به شما پیشنهاد می‌کنیم ادامه این مطلب را بادقت مطالعه
                            کنید
                            تا اطلاعات و مهارت موردنیاز برای انجام این کار را به دست بیاورید.
                        </p>
                    </div>
                    <Comments class="mt-12 w-[90%] sm:!w[100%]"/>
                </div>
            </div>
        </div>
    </div>
</template>

<style scoped lang="scss">
.article-banner {
    border-radius: 7.535px;
    box-shadow: 0px 3.0141px 15.82403px 0px rgba(0, 0, 0, 0.11);
}

.date {
    color: #6941C6;
    font-size: 14px;
    font-weight: 600;
    line-height: 18.442px;
    margin-top: 11px;
    margin-bottom: 11px;
}

.content {
    margin-top: 11px;
    line-height: 22.131px;

    p {
        font-weight: normal;
        margin-bottom: .5rem;
    }

    h2,
    h3,
    h4,
    h5,
    h6 {
        color: var(--color-black);
        font-size: var(--h5-font-size);
        margin-top: 2rem;
        margin-bottom: .5rem;
    }
}

.card {
    padding: 18px;
}</style>